Revit 2027 API
VisibleInViewFilter Constructor
Overload List
Name | Description
VisibleInViewFilter(Document, ElementId) |  Constructs a new instance of a VisibleInViewFilter.
VisibleInViewFilter(Document, ElementId, Boolean) |  Constructs a new instance of a VisibleInViewFilter, with the option to pass all non-visible elements.
Top
See Also
Reference
VisibleInViewFilter Class
Autodesk.Revit.DB Namespace